<!--
Οι σταθερές δεν μπορούν να αλλάξουν μόλις δηλωθεί.

Οι σταθερές κλάσης μπορεί να είναι χρήσιμες εάν πρέπει να ορίσετε ορισμένα σταθερά δεδομένα σε μια κλάση.

Μια σταθερά κλάσης δηλώνεται μέσα σε μια κλάση με τη λέξη κλειδί const.

Οι σταθερές κλάσης είναι ευαίσθητες σε πεζά. Ωστόσο, συνιστάται να ονομάσετε τις σταθερές
όλα τα κεφαλαία γράμματα.

Μπορούμε να έχουμε πρόσβαση σε μια σταθερά έξω από την κλάση χρησιμοποιώντας το όνομα της κλάσης
ακολουθούμενο από το τελεστής ανάλυσης εύρους (: :) ακολουθούμενος από το σταθερό όνομα, όπως εδώ:
-->
<!DOCTYPE html>
<html>
<body>

<?php
class name {
  const namec = "Konstantinos";
}

echo name::namec;
?>

</body>
</html>
