<!--
Ο καταστροφέας καλείται όταν το αντικείμενο καταστραφεί ή το σενάριο σταματήσει ή βγει.

Εάν δημιουργήσετε μια συνάρτηση __destruct (), η PHP θα καλέσει αυτόματα αυτήν τη συνάρτηση στο τέλος 
του σεναρίου.

Παρατηρήστε ότι η συνάρτηση καταστροφής ξεκινά με δύο κάτω παύλες (__)!

Το παρακάτω παράδειγμα έχει μια συνάρτηση __construct () που καλείται αυτόματα όταν δημιουργείτε ένα
αντικείμενο από μια κλάση και μια συνάρτηση __destruct () που καλείται αυτόματα στο τέλος του σεναρίου:
-->

<!DOCTYPE html>
<html>
<body>

<?php
class Fruit3 {
  public $name;
  public $color;

  function __construct($name) {
    $this->name = $name; 
  }
  function __destruct() {
    echo "The fruit is {$this->name}."; 
  }
}

$apple = new Fruit3("Apple");
?>
 
</body>
</html>
