<!--
Η PHP υποστηρίζει μόνο μια κληρονομιά: μια παιδική κλάση μπορεί να κληρονομήσει μόνο από έναν μόνο γονέα.

Λοιπόν, τι γίνεται αν μια κλάση πρέπει να κληρονομήσει πολλές συμπεριφορές; 
Τα χαρακτηριστικά OOP λύνουν αυτό το πρόβλημα.

Τα γνωρίσματα χρησιμοποιούνται για να δηλώσουν μεθόδους που μπορούν να χρησιμοποιηθούν σε πολλές κατηγορίες.
Τα γνωρίσματα μπορούν να έχουν μεθόδους και αφηρημένες μεθόδους που μπορούν 
να χρησιμοποιηθούν σε πολλές κατηγορίες,
και οι μέθοδοι μπορούν να έχουν οποιονδήποτε τροποποιητή πρόσβασης (δημόσιος, ιδιωτικός ή προστατευμένος).

Τα χαρακτηριστικά δηλώνονται με τη λέξη-κλειδί γνώρισμα:
-->

<?php
trait TraitName {
  // κώδικας...
}
?>

<!--Για να χρησιμοποιήσετε ένα χαρακτηριστικό σε μια κλάση, χρησιμοποιήστε τη λέξη-κλειδί use:-->

<?php
class MyClass {
  use TraitName;
}
?>

<?php
trait message1 {
public function msg1() {
    echo "OOP is fun! ";
  }
}

class Welcome {
  use message1;
}

$obj = new Welcome();
$obj->msg1();
?>

