<!--
PHP Τελεστές:

+	Πρόσθεση
-	Αφαίρεση
*	Πολλαπλασιασμός
**	Exponentiation
/	Διαίρεση
%	Μέτρο (Υπόλοιπο διαίρεσης)
++	Αύξηση
--	Μείωση

=   => a = b
+=  => a = a + b
-=	=> a = a - b
*=	=> a = a * b
/=	=> a = a / b
%=	=> a = a % b

==	ίσο με
===	ίση τιμή και ίσος τύπος
!=	όχι ίσο
<>  όχι ίσο
!==	όχι ίσης αξίας ή όχι ίσου τύπου
>	μεγαλύτερος από
<	λιγότερο από
>=	μεγαλύτερο ή ίσο με
<=	μικρότερο ή ίσο με
<=> spaceship

and	 λογικό και
or	 λογικό ή
xor	 λογικό xor
&&	 λογικό και
||	 λογικό ή
!	 λογικό όχι (δεν)

.	concatenation (αληλουχία)
.=	concatenation assignment (ανάθεση συνένωσης)

+	ένωση
==	ίση τιμή 
===	ίση τιμή και ίσος τύπος
!=	όχι ίσο
<>	ανισότητα
!==	μη ανισότητα	

?:	ternary(τριαδικός)
??	null coalescing	(μηδενική συνένωση)
-->