<!--
    $exp = "/expressions/i";

    Συναρτήσεις:
    preg_match()  - Επιστρέφει 1 εάν το μοτίβο βρέθηκε στη συμβολοσειρά και 0 εάν όχι
    preg_match_all() - Επιστρέφει τον αριθμό των φορών που το μοτίβο βρέθηκε στη συμβολοσειρά, η οποία μπορεί επίσης να είναι 0
    preg_replace() - Επιστρέφει μια νέα συμβολοσειρά όπου τα αντιστοιχισμένα μοτίβα έχουν αντικατασταθεί με μια άλλη συμβολοσειρά

    Τροποποιητές:
    i - Πραγματοποιεί αναζήτηση χωρίς κεφαλαία
    m - Εκτελεί μια αναζήτηση πολλαπλών γραμμών (μοτίβα που αναζητούν την αρχή ή το τέλος μιας συμβολοσειράς θα ταιριάζουν με την αρχή ή το τέλος κάθε γραμμής)
    u - Επιτρέπει τη σωστή αντιστοίχιση των κωδικοποιημένων μοτίβων UTF-8

    Patterns - Μοτίβα:
    [abc] - Βρείτε έναν χαρακτήρα από τις επιλογές μεταξύ των αγκυλών
    [^abc] - Βρείτε οποιοδήποτε χαρακτήρα ΟΧΙ μεταξύ των αγκυλών
    [0-9] - Βρείτε έναν χαρακτήρα από το εύρος 0 έως 9

    Μεταχαρακτήρες:
    |   Βρείτε ένα τέριασμα για οποιοδήποτε από τα μοτίβα που διαχωρίζονται με | 
    .   Βρείτε μόνο μία παρουσία οποιουδήποτε χαρακτήρα
    ^	Βρίσκει έναν αγώνα ως αρχή μιας συμβολοσειράς 
    $	Βρίσκει έναν τεριασμα στο τέλος της συμβολοσειράς
    \d	Βρίσκει ένα ψηφίο
    \s	Βρίσκει χαρακτήρα κενών διαστημάτων
    \b	Βρίσκει μια αντιστοίχιση στην αρχή μιας λέξης ή στο τέλος μιας λέξης 
    \uxxxx	Βρίσκειο χαρακτήρας Unicode που καθορίζεται από τον δεκαεξαδικό αριθμό xxxx

    n+	Ταιριάζει με οποιαδήποτε συμβολοσειρά που περιέχει τουλάχιστον ένα n
    n*	Ταιριάζει με οποιαδήποτε συμβολοσειρά που περιέχει μηδέν ή περισσότερες εμφανίσεις του n
    n?	Ταιριάζει με οποιαδήποτε συμβολοσειρά που περιέχει μηδέν ή μία εμφανίσεις του n
    n{x}	Ταιριάζει με οποιαδήποτε συμβολοσειρά που περιέχει μια ακολουθία X n's
    n{x,y}	Ταιριάζει με οποιαδήποτε συμβολοσειρά που περιέχει μια ακολουθία από X έως Y n's
    n{x,}	Ταιριάζει με οποιαδήποτε συμβολοσειρά που περιέχει μια ακολουθία τουλάχιστον X n's
-->

<!DOCTYPE html>
<html>
<body>

<?php
$str = "Regular Expr";
$pattern = "/Expr/i";
echo preg_replace($pattern, "Expression", $str);
?>

</body>
</html>
